IdeaRS.OpenModel.Connection.ConcreteBlockData
Provides data of the single concrete block

IdeaRS.OpenModel.Connection.ConcreteBlockData.Id
Plate unique ID

IdeaRS.OpenModel.Connection.ConcreteBlockData.Name
Name of the concrete block

IdeaRS.OpenModel.Connection.ConcreteBlockData.Depth
Depth of the concrete block

IdeaRS.OpenModel.Connection.ConcreteBlockData.Material
Name of the material

IdeaRS.OpenModel.Connection.ConcreteBlockData.Center
Center of the concrete block LCS

IdeaRS.OpenModel.Connection.ConcreteBlockData.OutlinePoints
Outline points

IdeaRS.OpenModel.Connection.ConcreteBlockData.Origin
Origin of the concrete block LCS

IdeaRS.OpenModel.Connection.ConcreteBlockData.AxisX
LCS - Axis X

IdeaRS.OpenModel.Connection.ConcreteBlockData.AxisY
LCS - Axis Y

IdeaRS.OpenModel.Connection.ConcreteBlockData.AxisZ
LCS - Axis Z

IdeaRS.OpenModel.Connection.ConcreteBlockData.Region
Geometry of the concrete block in svg format

IdeaRS.OpenModel.Connection.ConcreteBlockData.OriginalModelId
Get or set the identification in the original model
In the case of the imported connection from another application